In [1]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [3]:
df1 = DataFrame({'key': list('bbacaab'),
                'data1': range(7)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [12]:
df2 = DataFrame({'key': list('abd'),
                'data2': range(3)})
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [13]:
pd.merge(df1,df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

명시적으로 on = 'key' 처럼 지정하는게 나음

In [14]:
pd.merge(df1,df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [9]:
df3 = DataFrame({'lkey': list('bbacaab'),
                'data1': range(7)})
df4 = DataFrame({'rkey': list('abd'),
                'data2': range(3)})

In [10]:
pd.merge(df3,df4, left_on = 'lkey', right_on = 'rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [15]:
pd.merge(df1,df2, how = 'outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

 <br>
___

In [16]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'],
                 'key2': ['one', 'two', 'one'],
                 'lval': [1, 2, 3]})
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                  'key2': ['one', 'one', 'one', 'two'],
                  'rval': [4, 5, 6, 7]})

In [17]:
pd.merge(left, right, on = ['key1', 'key2'], how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [19]:
pd.merge(left,right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [20]:
pd.merge(left,right, on='key1', suffixes = ['_left', '_right'])

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

  ___

In [28]:
left1 = DataFrame({'key': list('abaabc'),
                  'value': range(6)})
right1 = DataFrame({'group_val': [3.5, 7]},
                   index = ['a', 'b'])

In [29]:
pd.merge(left1, right1, left_on='key', right_index = True).set_index('key')

     value  group_val
key
a        0        3.5
a        2        3.5
a        3        3.5
b        1        7.0
b        4        7.0

___

In [31]:
left2 = DataFrame([[1,2], [3,4], [5,6]], index = list('ace'), columns = ['Ohio', 'Nevada'])
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [32]:
right2 = DataFrame([[7,8], [9,10], [11,12], [13,14]], index = list('bcde'), columns = ['Missouri', 'Alabama'])
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [34]:
pd.merge(left2, right2, left_index=True, right_index = True, how = 'outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [35]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
c     3       4       9.0     10.0
e     5       6      13.0     14.0

In [38]:
right2.join(left2, how = 'outer')

   Missouri  Alabama  Ohio  Nevada
a       NaN      NaN   1.0     2.0
b       7.0      8.0   NaN     NaN
c       9.0     10.0   3.0     4.0
d      11.0     12.0   NaN     NaN
e      13.0     14.0   5.0     6.0

In [39]:
extra1 = DataFrame([[7,8], [9,10], [11,12], [16, 17]], index = list('acef'), columns = ['New York', 'Oregon'])
extra1

   New York  Oregon
a         7       8
c         9      10
e        11      12
f        16      17

In [40]:
left2.join([right2, extra1], how = 'outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

___

In [41]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [43]:
np.concatenate([arr,arr], axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [44]:
s1 = Series([0,1], index = ['a', 'b'])
s2 = Series([2, 3, 4], index = ['c', 'd', 'e'])
s3 = Series([5,6], index = ['f', 'g'])

In [47]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [48]:
pd.concat([s1, s2, s3], axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [49]:
s4 = pd.concat([s1*5, s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [51]:
pd.concat([s1,s4], axis = 1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [53]:
pd.concat([s1,s4], axis = 1, join = 'inner')

   0  1
a  0  0
b  1  5

In [56]:
pd.concat([s1, s4], axis = 1, join_axes = [list('abcd')])

     0    1
a  0.0  0.0
b  1.0  5.0
c  NaN  NaN
d  NaN  NaN

In [58]:
result = pd.concat([s1, s2, s3], keys = ['s1', 's2', 's3'])
result

s1  a    0
    b    1
s2  c    2
    d    3
    e    4
s3  f    5
    g    6
dtype: int64

In [59]:
result.unstack()

      a    b    c    d    e    f    g
s1  0.0  1.0  NaN  NaN  NaN  NaN  NaN
s2  NaN  NaN  2.0  3.0  4.0  NaN  NaN
s3  NaN  NaN  NaN  NaN  NaN  5.0  6.0